app/controllers/reports_controller.rb

  def create
    puts "ciao porco dioooooooooooooooooooooooooooooooooooooooooooooooooo|||||||||||||||||||||||||||||||||||||||"

    @report = Report.new(report_params)

    if @report.save
---
INSERT INTO "reports" ("ora", "data", "coordinate", "user_id", "operator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)