app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all  # Se hai un modello User e vuoi visualizzare tutti gli utenti